dict1 = {"name": "tom", "age": "27", "sal": "5000"}
print("字典取值：%s" % dict1.get("name"))  # dict.get() 获取字典中指定键的值，没有返回None，或者自定义的字符串。

# 字符串格式化输出 str.format()
# 1.{索引}/{参数} 的方式
a = "名字是{0},年龄{1}"
print(a.format("小明","18"))

b = "名字是{name},年龄{age}"
print(b.format(age=18, name="小红"))

print('{:-<50}'.format('*'*30))  # 字符串格式化输出

# 2.填充对齐 ^:居中  >:右对齐  <:左对齐
c = "我是{0}，我喜欢数字{1:*^8}"  # * 为填充符(默认为空格) ,^ 居中 ,最终返回字符串长度8
print(c.format("小刚", "666"))

# 3.数字格式化
d = "我是{0}，我的存款{1:.2f}"
print(d.format("小白", 1254.637))